; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-2-2-2-4-4-6) (:domain depots)
(:objects
	depot0 depot1 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 - Crate
	hoist0 hoist1 hoist2 hoist3 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate4)
	(at pallet2 distributor0)
	(clear pallet2)
	(at pallet3 distributor1)
	(clear crate5)
	(at truck0 distributor1)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 distributor0)
	(available hoist2)
	(at hoist3 distributor1)
	(available hoist3)
	(at crate0 distributor1)
	(on crate0 pallet3)
	(at crate1 depot1)
	(on crate1 pallet1)
	(at crate2 distributor1)
	(on crate2 crate0)
	(at crate3 distributor1)
	(on crate3 crate2)
	(at crate4 depot1)
	(on crate4 crate1)
	(at crate5 distributor1)
	(on crate5 crate3)
)

(:goal (and
		(on crate1 pallet3)
		(on crate2 pallet2)
		(on crate3 crate2)
		(on crate4 crate5)
		(on crate5 pallet1)
	)
))

; plan
1. (lift hoist3 crate5 crate3 distributor1)
   deleted: (at crate5 distributor1) (available hoist3) (on crate5 crate3) (clear crate5)
   added: (lifting hoist3 crate5) (clear crate3)
   goals met: 1 of 5
2. (load hoist3 crate5 truck0 distributor1)
   deleted: (lifting hoist3 crate5)
   added: (in crate5 truck0) (available hoist3)
   goals met: 1 of 5
3. (lift hoist3 crate3 crate2 distributor1)
   deleted: (at crate3 distributor1) (available hoist3) (on crate3 crate2) (clear crate3)
   added: (lifting hoist3 crate3) (clear crate2)
   goals met: 0 of 5
4. (load hoist3 crate3 truck0 distributor1)
   deleted: (lifting hoist3 crate3)
   added: (in crate3 truck0) (available hoist3)
   goals met: 0 of 5
5. (lift hoist3 crate2 crate0 distributor1)
   deleted: (at crate2 distributor1) (available hoist3) (on crate2 crate0) (clear crate2)
   added: (lifting hoist3 crate2) (clear crate0)
   goals met: 0 of 5
6. (load hoist3 crate2 truck0 distributor1)
   deleted: (lifting hoist3 crate2)
   added: (in crate2 truck0) (available hoist3)
   goals met: 0 of 5
7. (lift hoist1 crate4 crate1 depot1)
   deleted: (at crate4 depot1) (available hoist1) (on crate4 crate1) (clear crate4)
   added: (lifting hoist1 crate4) (clear crate1)
   goals met: 0 of 5
8. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 0 of 5
9. (load hoist1 crate4 truck0 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   goals met: 0 of 5
10. (lift hoist1 crate1 pallet1 depot1)
   deleted: (at crate1 depot1) (available hoist1) (on crate1 pallet1) (clear crate1)
   added: (lifting hoist1 crate1) (clear pallet1)
   goals met: 0 of 5
11. (load hoist1 crate1 truck1 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck1) (available hoist1)
   goals met: 0 of 5
12. (unload hoist1 crate5 truck0 depot1)
   deleted: (available hoist1) (in crate5 truck0)
   added: (lifting hoist1 crate5)
   goals met: 0 of 5
13. (drop hoist1 crate5 pallet1 depot1)
   deleted: (lifting hoist1 crate5) (clear pallet1)
   added: (at crate5 depot1) (available hoist1) (on crate5 pallet1) (clear crate5)
   goals met: 1 of 5
14. (unload hoist1 crate4 truck0 depot1)
   deleted: (available hoist1) (in crate4 truck0)
   added: (lifting hoist1 crate4)
   goals met: 1 of 5
15. (drop hoist1 crate4 crate5 depot1)
   deleted: (lifting hoist1 crate4) (clear crate5)
   added: (at crate4 depot1) (available hoist1) (on crate4 crate5) (clear crate4)
   goals met: 2 of 5
16. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   goals met: 2 of 5
17. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 2 of 5
18. (lift hoist3 crate0 pallet3 distributor1)
   deleted: (at crate0 distributor1) (available hoist3) (on crate0 pallet3) (clear crate0)
   added: (lifting hoist3 crate0) (clear pallet3)
   goals met: 2 of 5
19. (load hoist3 crate0 truck1 distributor1)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck1) (available hoist3)
   goals met: 2 of 5
20. (unload hoist2 crate2 truck0 distributor0)
   deleted: (available hoist2) (in crate2 truck0)
   added: (lifting hoist2 crate2)
   goals met: 2 of 5
21. (drop hoist2 crate2 pallet2 distributor0)
   deleted: (lifting hoist2 crate2) (clear pallet2)
   added: (at crate2 distributor0) (available hoist2) (on crate2 pallet2) (clear crate2)
   goals met: 3 of 5
22. (unload hoist2 crate3 truck0 distributor0)
   deleted: (available hoist2) (in crate3 truck0)
   added: (lifting hoist2 crate3)
   goals met: 3 of 5
23. (drop hoist2 crate3 crate2 distributor0)
   deleted: (lifting hoist2 crate3) (clear crate2)
   added: (at crate3 distributor0) (available hoist2) (on crate3 crate2) (clear crate3)
   goals met: 4 of 5
24. (unload hoist3 crate1 truck1 distributor1)
   deleted: (available hoist3) (in crate1 truck1)
   added: (lifting hoist3 crate1)
   goals met: 4 of 5
25. (drop hoist3 crate1 pallet3 distributor1)
   deleted: (lifting hoist3 crate1) (clear pallet3)
   added: (at crate1 distributor1) (available hoist3) (on crate1 pallet3) (clear crate1)
   goals met: 5 of 5
